"Create Vault" = "பெட்டகத்தை உருவாக்கு";

"Lock Vault" = "பூட்டு பெட்டகம்";
"Unlock Vault" = "பெட்டகத்தைத் திற";
"Provide a passphrase for the Cryptomator Vault {0}" = "மறைத்தல் பெட்டகம் {0} க்கு ஒரு கடவுச்சொற்றேவை வழங்கவும்";
"Provide your passphrase to unlock the Cryptomator Vault {0}" = "மறைத்தல் பெட்டகம் {0} ஐ திறக்க உங்கள் கடவுச்சொற்றேவை வழங்கவும்";
"Passphrase" = "கடவுச்சொற்றேவை";
"Confirm Passphrase" = "கடவுச்சொற்றேவையை உறுதிப்படுத்தவும்";

"Very weak" = "மிகவும் பலவீனமாக";
"Weak" = "மென்";
"Fair" = "நியாயமான";
"Strong" = "வலுவான";
"Very strong" = "மிகவும் பலமான";

"Encrypted" = "குறியாக்கப்பட்டது";
"Decrypted" = "மறைகுறியாக்கப்பட்டது";
